# 1 Introduction
ในบทนี้เราจะเน้นที่ Library 2 ตัวคือ `Pandas` และ `NumPy` ซึ่งจะช่วยได้มากในการทำ Data Analysis

# 2 Gapminder Data

มี Data ให้ 5 Table

ด้วย Data ชุดนี้จะตอบคำถามอะไรได้บ้าง คิดมา 5 ข้อ

In [13]:
import unicodecsv

#read data from CSV file and make it to lists
def read_csv(filename):
    with open(filename, 'rb') as f:
        reader = unicodecsv.DictReader(f)
        return list(reader)

In [27]:
# 5 table
employment_levels = read_csv('../data/chapter2/employment_above_15.csv')
life_expectancy = read_csv('../data/chapter2/life_expectancy.csv')
gdp_per_capita = read_csv('../data/chapter2/gdp_per_capita.csv')
female_completion_rate = read_csv('../data/chapter2/female_completion_rate.csv')
male_completion_rate = read_csv('../data/chapter2/male_completion_rate.csv')

In [31]:
import pandas as pd

pd.DataFrame(employment_levels[0:3])

,Country,1991,1992,1993,1994,1995,1996,1997,1998,1999,2000,2001,2002,2003,2004,2005,2006,2007
0,Afghanistan,56.7000007629,56.5,56.5999984741,56.2000007629,56.2000007629,56.0999984741,56.2000007629,56.2000007629,56.0999984741,56.0999984741,56.5,56.4000015259,54.4000015259,56,54,56,55.7000007629
1,Albania,52.7000007629,52.2999992371,52.4000015259,52.7000007629,52.7999992371,52.5999984741,52.4000015259,52.0999984741,52.0999984741,51.9000015259,51.7999992371,51.7999992371,51.7999992371,51.7000007629,51.5,51.4000015259,51.4000015259
2,Algeria,39.4000015259,38.9000015259,39.4000015259,39.4000015259,38.0999984741,38.9000015259,39.7000007629,39.5,39.4000015259,38.5999984741,40.4000015259,41.5,42.7999992371,46.4000015259,48,50,50.5

In [32]:
pd.DataFrame(life_expectancy[0:3])

,Country,1800,1801,1802,1803,1804,1805,1806,1807,1808,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Afghanistan,28.211,28.2007533333,28.1905066667,28.18026,28.1700133333,28.1597666667,28.14952,28.1392733333,28.1290266667,...,52.5,52.9,53.2,53.6,54,54.5,54.8,55.2,55.5,56.2
1,Albania,35.4,35.4,35.4,35.4,35.4,35.4,35.4,35.4,35.4,...,74.4,74.4,74.5,74.7,74.9,75,75.2,75.5,75.7,75.8
2,Algeria,28.8224,28.8224,28.8224,28.8224,28.8224,28.8224,28.8224,28.8224,28.8224,...,74.2,74.5,74.8,75,75.3,75.6,75.9,76.1,76.2,76.3

In [33]:
pd.DataFrame(gdp_per_capita[0:3])

,Country,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011
0,Abkhazia,,,,,,,,,,...,,,,,,,,,,
1,Afghanistan,,,,,,,,,,...,,,,,,,,,,
2,Akrotiri and Dhekelia,,,,,,,,,,...,,,,,,,,,,

In [34]:
pd.DataFrame(female_completion_rate[0:3])

,Country,1970,1971,1972,1973,1974,1975,1976,1977,1978,...,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011
0,Abkhazia,,,,,,,,,,...,,,,,,,,,,
1,Afghanistan,,,,,4.19285,,,5.14529,5.91965,...,,,,18.74188,,,,,,
2,Akrotiri and Dhekelia,,,,,,,,,,...,,,,,,,,,,

In [35]:
pd.DataFrame(male_completion_rate[0:3])

,Country,1970,1971,1972,1973,1974,1975,1976,1977,1978,...,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011
0,Abkhazia,,,,,,,,,,...,,,,,,,,,,
1,Afghanistan,,,,,26.23178,,,26.73849,29.07336,...,,,,48.3607,,,,,,
2,Akrotiri and Dhekelia,,,,,,,,,,...,,,,,,,,,,

ดูจาก table ข้างบนคร่าวๆจะเห็นว่าข้อมูลเป็นสัญญาณ time series 

* มี dimensions คือ ประเทศต่างๆทั่วโลก
* มี metric คือ ปริมาณตามชื่อ table เลย

เมื่อพิจารณาดูเรามีคำถามในใจดังนี้
1. correlation between employment_levels with life_expectancy
2. correlation between gdp_per_capita with life_expectancy
3. correlation between gdp_per_capita with employment_levels
4. prime time of the world (Highest employment_levels, gdp_per_capita)
5. bad time of the world (lowest employment_levels, gdp_per_capita)
6. correlation between employment_levels with male/female_completion_rate
7. male VS female_completion_rate
8. เราสามารถ predict employment_levels จากข้อมูลอะไรได้

$\dots$